// Задайте одномерный массив, заполненный случайными числами. Найдите сумму элементов, стоящих на нечётных позициях.

int[] array = GetPrintArray(10, 0, 11);
Console.WriteLine();
Console.WriteLine(SumOddNumber());

int[] GetPrintArray(int size, int minValue, int maxValue)
{
    int[] arr = new int[size];
    for (int i = 0; i < size; i++)
    {
        arr[i] = new Random().Next(minValue, maxValue + 1);
        Console.Write(arr[i] + " ");
    }
    return arr;
}
int SumOddNumber()
{
    int sum = 0;
    for (int i = 1; i < array.Length; i += 2)
    {
        sum += array[i];
    }
    return sum;
}



